public/resume.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2020-03-27 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>&lrm;</title>
<meta name="generator" content="Org mode">
<meta name="author" content="jowj">
<link rel="stylesheet" type="text/css" href="../org/src/alt-dark.css" />
</head>
<body>
<div id="preamble" class="status">
<a href="./index.html">About</a>
<a href="./articles.html">Articles</a>
<a href="./projects/index.html">Projects</a>
<a href="./atom.xml">Feed</a>
</div>
<div id="content">
<div class="org-center">
<p>
<b>Josiah Ledbetter</b>
</p>

<p>
6602 Willamette Dr, Austin, TX, 78723
</p>

<p>
(512) 554-8976; me@jowj.net
</p>
</div>
<div id="outline-container-org90d1552" class="outline-2">
<h2 id="org90d1552">Skills</h2>
<div class="outline-text-2" id="text-org90d1552">
</div>
<div id="outline-container-org3a79550" class="outline-3">
<h3 id="org3a79550">Sysops</h3>
<div class="outline-text-3" id="text-org3a79550">
<ul class="org-ul">
<li>Extensive knowledge of Windows Server 2003-2012R2 and IIS 6-8.5.</li>
<li>Intermediate knowledge of AD and Group Policy.</li>
<li>Intermediate knowledge of nix OSes.</li>
</ul>
</div>
</div>

<div id="outline-container-org3afaafd" class="outline-3">
<h3 id="org3afaafd">Programming &amp; automation</h3>
<div class="outline-text-3" id="text-org3afaafd">
<ul class="org-ul">
<li>Python API libraries &amp; command line tools.</li>
<li>Config management through Ansible.</li>
<li>Deployment automation through Docker, Powershell, and Python.</li>
</ul>
</div>
</div>
<div id="outline-container-orgfae2eb6" class="outline-3">
<h3 id="orgfae2eb6">Security tools</h3>
<div class="outline-text-3" id="text-orgfae2eb6">
<ul class="org-ul">
<li>Extensive knowledge of Rapid7 Nexpose Vulnerability Scanner.</li>
<li>Intermediate knowledge of Splunk.</li>
<li>Intermediate knowledge of Rapid7 IDR.</li>
<li>Intermediate knowledge of CylancePROTECT.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgd57e0bf" class="outline-2">
<h2 id="orgd57e0bf">Technical Experience</h2>
<div class="outline-text-2" id="text-orgd57e0bf">
</div>
<div id="outline-container-orgd043182" class="outline-3">
<h3 id="orgd043182">Information Security Engineer at Planview, May 2019 - Current</h3>
<div class="outline-text-3" id="text-orgd043182">
<ul class="org-ul">
<li>Built out library for talking with Rapid7 Investigations in IDR.</li>
<li>Automated pulling alerts from IDR and posting non-sensitive information to slack for broader team use during incident response.
<ul class="org-ul">
<li>This was later used as a system of record for SOCII compliance.</li>
</ul></li>
<li>Created a scanning and remediation process for all products under the Planview umbrella.</li>
<li>Rolled out Powershell, Macroscript whitelist initiative to all employees through Cylance.</li>
</ul>
</div>
</div>

<div id="outline-container-orgcec555d" class="outline-3">
<h3 id="orgcec555d">Information Security Engineer at Volusion, April 2017 - May 2019</h3>
<div class="outline-text-3" id="text-orgcec555d">
<ul class="org-ul">
<li>Reimplemented the scanning and remediation program.</li>
<li>Deployed Splunk from scratch for use as a SEIM.</li>
<li>Built out Rapid7 Nexpose infra to decrease scan times from &gt; 24 hours to &lt; 8.</li>
<li>Spearheaded compliance efforts with PCI and internal security policy.</li>
<li>Created automation tooling through Powershell, Python, and Ansible.</li>
</ul>
</div>
</div>

<div id="outline-container-org8b98085" class="outline-3">
<h3 id="org8b98085">Systems Engineer at Volusion, December 2015 - April 2017</h3>
<div class="outline-text-3" id="text-org8b98085">
<ul class="org-ul">
<li>Planned and executed upgrades to out of support applications.</li>
<li>Created SQL cluster build automation in Powershell to decrease department turn-around time during cluster builds.</li>
<li>Planned and executed large scale AV upgrades in corporate, production, and payments environments.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgee49b36" class="outline-2">
<h2 id="orgee49b36">Open source projects &amp; self hosting</h2>
<div class="outline-text-2" id="text-orgee49b36">
<ul class="org-ul">
<li><a href="https://git.awful.club/projects/pynit">pynit</a>: an automatable way to sync reddit saved-posts to <a href="https://pinboard.in">pinboard</a>.</li>
<li><a href="https://git.awful.club/hosted">hosted</a>: list of projects i'm self hosting and actively using, including:
<ul class="org-ul">
<li>nextcloud</li>
<li>gitea</li>
<li>znc</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgc614397" class="outline-2">
<h2 id="orgc614397">Other</h2>
<div class="outline-text-2" id="text-orgc614397">
<ul class="org-ul">
<li>Experience with PCI, SOCII compliance frameworks</li>
<li>Intermediate trapeze skills</li>
<li>CompTIA Sec+</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: </p>
<p class="creator">Made with <a href="https://www.gnu.org/software/emacs/">Emacs</a> 26.3 (<a href="https://orgmode.org">Org</a> mode 9.1.9)</p>
</div>
</body>
</html>
